too1/nrf52-thingy-midi-player/ble_thingy_client/ble_thingy_tms_c.c
        for (uint32_t i = 0; i < p_evt->params.discovered_db.char_count; i++)
        {
            const ble_gatt_db_char_t * p_char = &(p_evt->params.discovered_db.charateristics[i]);
            switch (p_char->characteristic.uuid.uuid)
            {
                case THINGY_TMS_UUID_CONFIG_CHAR:
                    evt.params.peer_db.config_handle = p_char->characteristic.handle_value;
                    break;
                case THINGY_TMS_UUID_TAP_CHAR:
                    evt.params.peer_db.tap_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.tap_cccd_handle = p_char->cccd_handle;
                    break;
                case THINGY_TMS_UUID_ORIENTATION_CHAR: 
                    evt.params.peer_db.orientation_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.orientation_cccd_handle = p_char->cccd_handle;
                    break;      
                case THINGY_TMS_UUID_QUATERNION_CHAR:    
                    evt.params.peer_db.quaternion_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.quaternion_cccd_handle = p_char->cccd_handle;
                    break;   
                case THINGY_TMS_UUID_STEP_COUNTER_CHAR:       
                    evt.params.peer_db.step_counter_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.step_counter_cccd_handle = p_char->cccd_handle;
                    break;
                case THINGY_TMS_UUID_RAW_CHAR:      
                    evt.params.peer_db.raw_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.raw_cccd_handle = p_char->cccd_handle;
                    break;
                case THINGY_TMS_UUID_EULER_CHAR:              
                    evt.params.peer_db.euler_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.euler_cccd_handle = p_char->cccd_handle;
                    break;
                case THINGY_TMS_UUID_ROTATION_MATRIX_CHAR:    
                    evt.params.peer_db.rotation_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.rotation_cccd_handle = p_char->cccd_handle;
                    break;
                case THINGY_TMS_UUID_HEADING_CHAR:            
                    evt.params.peer_db.heading_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.heading_cccd_handle = p_char->cccd_handle;
                    break;
                case THINGY_TMS_UUID_GRAVITY_VECTOR_CHAR:     
                    evt.params.peer_db.gravity_handle      = p_char->characteristic.handle_value;
                    evt.params.peer_db.gravity_cccd_handle = p_char->cccd_handle;
                    break;
                default:
                    break;
            }
        }

        NRF_LOG_DEBUG("Led Button Service discovered at peer.");
        //If the instance has been assigned prior to db_discovery, assign the db_handles
        if (p_ble_thingy_tms_c->conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            if ((p_ble_thingy_tms_c->peer_thingy_tms_db.config_handle         == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.tap_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.tap_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.orientation_cccd_handle == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.orientation_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.quaternion_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.quaternion_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.step_counter_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.step_counter_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.raw_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.raw_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.rotation_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.rotation_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.heading_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.heading_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.gravity_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.gravity_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.euler_cccd_handle      == BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tms_c->peer_thingy_tms_db.euler_handle   == BLE_GATT_HANDLE_INVALID))
            {
                p_ble_thingy_tms_c->peer_thingy_tms_db = evt.params.peer_db;
            }
        }

        p_ble_thingy_tms_c->evt_handler(p_ble_thingy_tms_c, &evt);

    }
}


uint32_t ble_thingy_tms_c_init(ble_thingy_tms_c_t * p_ble_thingy_tms_c, ble_thingy_tms_c_init_t * p_ble_thingy_tms_c_init)
{
    uint32_t      err_code;
    ble_uuid_t    thingy_tms_uuid;
    ble_uuid128_t thingy_tms_base_uuid = {THINGY_TMS_UUID_BASE};

    VERIFY_PARAM_NOT_NULL(p_ble_thingy_tms_c);
    VERIFY_PARAM_NOT_NULL(p_ble_thingy_tms_c_init);
    VERIFY_PARAM_NOT_NULL(p_ble_thingy_tms_c_init->evt_handler);
  
    p_ble_thingy_tms_c->peer_thingy_tms_db.config_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.tap_handle = BLE_GATT_HANDLE_INVALID; 
    p_ble_thingy_tms_c->peer_thingy_tms_db.tap_cccd_handle = BLE_GATT_HANDLE_INVALID;       
    p_ble_thingy_tms_c->peer_thingy_tms_db.orientation_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.orientation_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.quaternion_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.quaternion_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.step_counter_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.step_counter_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.raw_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.raw_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.euler_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.euler_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.rotation_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.rotation_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.heading_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.heading_cccd_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.gravity_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_thingy_tms_c->peer_thingy_tms_db.gravity_cccd_handle = BLE_GATT_HANDLE_INVALID;
    
    p_ble_thingy_tms_c->conn_handle                    = BLE_CONN_HANDLE_INVALID;
    p_ble_thingy_tms_c->evt_handler                    = p_ble_thingy_tms_c_init->evt_handler;

    err_code = sd_ble_uuid_vs_add(&thingy_tms_base_uuid, &p_ble_thingy_tms_c->uuid_type);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    VERIFY_SUCCESS(err_code);

    thingy_tms_uuid.type = p_ble_thingy_tms_c->uuid_type;
    thingy_tms_uuid.uuid = THINGY_TMS_UUID_SERVICE;

