too1/nrf52-thingy-midi-player/ble_thingy_client/ble_thingy_tms_c.c
    return ble_db_discovery_evt_register(&thingy_tms_uuid);
}

void ble_thingy_tms_c_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    ble_thingy_tms_c_t * p_ble_thingy_tms_c = (ble_thingy_tms_c_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTC_EVT_HVX:
            on_hvx(p_ble_thingy_tms_c, p_ble_evt);
            break;

        case BLE_GATTC_EVT_WRITE_RSP:
            on_write_rsp(p_ble_thingy_tms_c, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnected(p_ble_thingy_tms_c, p_ble_evt);
            break;

        default:
            break;
    }
}


/**@brief Function for configuring the CCCD.
 *
 * @param[in] conn_handle The connection handle on which to configure the CCCD.
 * @param[in] handle_cccd The handle of the CCCD to be configured.
 * @param[in] enable      Whether to enable or disable the CCCD.
 *
 * @return NRF_SUCCESS if the CCCD configure was successfully sent to the peer.
 */
static uint32_t cccd_configure(uint16_t conn_handle, uint16_t handle_cccd, bool enable)
{
    NRF_LOG_DEBUG("Configuring CCCD. CCCD Handle = %d, Connection Handle = %d",
        handle_cccd,conn_handle);

    tx_message_t * p_msg;
    uint16_t       cccd_val = enable ? BLE_GATT_HVX_NOTIFICATION : 0;

    p_msg              = &m_tx_buffer[m_tx_insert_index++];
    m_tx_insert_index &= TX_BUFFER_MASK;

    p_msg->req.write_req.gattc_params.handle   = handle_cccd;
    p_msg->req.write_req.gattc_params.len      = 2;
    p_msg->req.write_req.gattc_params.p_value  = p_msg->req.write_req.gattc_value;
    p_msg->req.write_req.gattc_params.offset   = 0;
    p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_REQ;
    p_msg->req.write_req.gattc_value[0]        = LSB_16(cccd_val);
    p_msg->req.write_req.gattc_value[1]        = MSB_16(cccd_val);
    p_msg->conn_handle                         = conn_handle;
    p_msg->type                                = WRITE_REQ;

    tx_buffer_process();
    return NRF_SUCCESS;
}

static uint32_t cccd_configure_w_checking(ble_thingy_tms_c_t * p_ble_thingy_tms_c, uint16_t handle_cccd, bool enable)
{
    VERIFY_PARAM_NOT_NULL(p_ble_thingy_tms_c);
    
    if (p_ble_thingy_tms_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    return cccd_configure(p_ble_thingy_tms_c->conn_handle, handle_cccd, true);
}


uint32_t ble_thingy_tms_c_tap_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.tap_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_orientation_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.orientation_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_quaternion_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.quaternion_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_step_counter_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.step_counter_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_raw_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.raw_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_euler_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.euler_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_rotation_matrix_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.rotation_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_heading_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.heading_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_gravity_notif_enable(ble_thingy_tms_c_t * p_ble_thingy_tms_c)
{
    return cccd_configure_w_checking(p_ble_thingy_tms_c, p_ble_thingy_tms_c->peer_thingy_tms_db.gravity_cccd_handle, true);
}

uint32_t ble_thingy_tms_c_handles_assign(ble_thingy_tms_c_t    * p_ble_thingy_tms_c,
                                  uint16_t         conn_handle,
                                  const thingy_tms_db_t * p_peer_handles)
{
    VERIFY_PARAM_NOT_NULL(p_ble_thingy_tms_c);

    p_ble_thingy_tms_c->conn_handle = conn_handle;
    if (p_peer_handles != NULL)
    {
        p_ble_thingy_tms_c->peer_thingy_tms_db = *p_peer_handles;
    }
    return NRF_SUCCESS;
}

